constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          25;
        startFace       3650;
    }
    outlet
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          25;
        startFace       3675;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          150;
        startFace       3700;
    }
    frontAndBack
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          3750;
        startFace       3850;
    }
)

// ************************************************************************* //
