0/rhom
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.01";
    object      rhom;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1875
(
1003.92
1003.85
1003.86
1003.86
1003.86
1003.86
1003.86
1003.86
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
25
(
770.978
770.978
770.978
770.978
770.978
770.978
770.978
770.978
...
)
;
    }
    outlet
    {
        type            calculated;
        value           uniform 1027.1;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
1003.92
1026.89
1027.11
1027.11
1027.11
1027.11
1027.11
1027.11
...
)
;
    }
    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
